intern-airbotix/ESP32/config_defaults/sdkconfig.defaults.esp32c5
# Espressif IoT Development Framework (ESP-IDF) Project Minimal Configuration for Generic ESP32-C5
#
CONFIG_IDF_TARGET="esp32c5"
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=16
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_DB_GENERIC_BOARD=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_LOG_LEVEL_ERROR=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_ETH_USE_SPI_ETHERNET=n
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=n
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=1
CONFIG_FREERTOS_HZ=1000
CONFIG_IEEE802154_ENABLED=n
CONFIG_LWIP_LOCAL_HOSTNAME="DroneBridgeESP32"
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
CONFIG_LWIP_TCP_WND_DEFAULT=5744
CONFIG_MQTT_PROTOCOL_311=n
CONFIG_MQTT_TRANSPORT_SSL=n
CONFIG_WS_TRANSPORT=n
CONFIG_BUTTON_SHORT_PRESS_TIME_MS=350
